#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_mssql_database.sanduba_main_database will be created
  + resource "azurerm_mssql_database" "sanduba_main_database" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + geo_backup_enabled                                         = false
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 2
      + min_capacity                                               = (known after apply)
      + name                                                       = "sanduba-main-database"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = false
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "Basic"
      + storage_account_type                                       = "Local"
      + tags                                                       = {
          + "environment" = "development"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = false
    }

  # azurerm_mssql_server.sqlserver will be created
  + resource "azurerm_mssql_server" "sqlserver" {
      + administrator_login                  = (sensitive value)
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "eastus"
      + minimum_tls_version                  = "1.2"
      + name                                 = "sanduba-main-database-sqlserver"
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = "fiap-tech-challenge-database-group"
      + restorable_dropped_database_ids      = (known after apply)
      + tags                                 = {
          + "environment" = "development"
        }
      + version                              = "12.0"
    }

  # azurerm_redis_cache.sanduba_carrinho_database will be created
  + resource "azurerm_redis_cache" "sanduba_carrinho_database" {
      + capacity                      = 0
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus"
      + minimum_tls_version           = "1.2"
      + name                          = "sanduba-carrinho-database-redis"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "fiap-tech-challenge-database-group"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "environment" = "development"
        }
    }

  # azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id         = (known after apply)
      + location   = "eastus"
      + managed_by = "fiap-tech-challenge-main-group"
      + name       = "fiap-tech-challenge-database-group"
      + tags       = {
          + "environment" = "development"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @cangelosilima, Action: `pull_request`*